app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
    def show
        @movie = Movie.find(params[:id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
---
    def edit
      @movie = Movie.find(params[:id])

INSERT INTO "movies" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Movei number 1`"], ["description", "asdjfahlsjdfhalshdf"], ["created_at", "2015-04-23 01:31:43.584015"], ["updated_at", "2015-04-23 01:31:43.584015"]]
---
    def create
        @movie = Movie.new(params.require(:movie).permit(:title))

        if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 31]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Topic jkjkjk"], ["updated_at", "2015-04-24 16:13:39.801815"], ["id", 32]]
---
    def update
      @movie = Movie.find(params[:id])
      if @movie.update(post_params)