app/controllers/reviews_controller.rb

    def create
        @movie = Movie.find(params[:id])
        @review = @movie.reviews.new(params.require(:review).permit(:body, :score, :title, :description))

        @review.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "reviews" ("description", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "comment 1"], ["movie_id", 2], ["created_at", "2015-04-27 17:32:17.143771"], ["updated_at", "2015-04-27 17:32:17.143771"]]