app/controllers/sessions_controller.rb

  def create
    user = User.find_by(email: params[:login][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "nick@example.com"]]